export const genres = [
    'Драма',
    'Комедия',
    'Экшн',
    'Фантастика',
    'Ужасы',
    'Триллер',
    'Мультфильм',
    'Документальный',
    'Романтика',
];

export const years = [
    '2023 год',
    '2022 год',
    '2021 год',
    '2020 год',
    '2019 год',
    '2018 год',
    '2017 год',
    '2016 год',
    '2022-2023',
    '2021-2022',
    '2020-2022',
    '2019-2020',
    '2010-2020',
    '2010-2015',
    '2000-2010',
    '1990-2000',
    '1980-1990',
    'до 1980',
];

export const ratings = [
    'Больше 9',
    'Больше 8',
    'Больше 7',
    'Больше 6',
]